Catalogs/Кандидаты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>Кандидаты</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Вакансия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Вакансии</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Позиция</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ШтатноеРасписание</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЛичныеДанные</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛичныеДанныеКандидатов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаРегистрации</Name>
					<Comment>АПК:58 Имя не меняется для сохранения совместимости, синоним меняется на более лаконичный</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсточникИнформации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИсточникиИнформацииОКандидатах</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Резюме</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РезюмеТекст</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатусИзвлеченияТекста</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыИзвлеченияТекстаФайлов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Рейтинг</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОжидаемыйДоход</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СостоянияСогласования</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаРешения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КомментарийРешения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПричинаОтклонения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПричиныОтклоненияКандидатов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СреднийРейтинг</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УточнениеНаименования</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АдресРезюме</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОСебе</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВалютаДохода</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодичностьДохода</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПериодичностьОжидаемогоДоходаКандидатов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьФизическоеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьЭтапРаботы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЭтапыРаботыСКандидатами</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Оценки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Оценка</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Пользователь</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

InformationRegisters/ТекущиеЭтапыРаботыСКандидатами.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ТекущиеЭтапыРаботыСКандидатами</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ЭтапРаботы</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЭтапРаботыСКандидатами</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СостоянияЭтаповРаботыСКандидатами</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаВремя</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Кандидат</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Кандидаты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/СостоянияСогласования.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>СостоянияСогласования</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Отклонено</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Рассматривается</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Согласовано</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ИспользованиеШаблоновСообщенийПриПодбореПерсонала.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ИспользованиеШаблоновСообщенийПриПодбореПерсонала</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ОзнакомлениеСВакансией</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОзнакомлениеСКандидатом</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОзнакомлениеСКандидатами</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОдобрениеКандидата</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтклонениеКандидата</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИзменениеЭтапаРаботыСКандидатом</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПриглашениеНаЭлектронноеТестирование</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/Кандидаты/Forms/ФормаРешенияПоКандидату/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Кандидаты = Неопределено Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	// Распаковываем параметры.
	Решение = Параметры.Решение;
	ТолькоПросмотрРешения = Параметры.ТолькоПросмотрРешения;
	ДатаРешения = Параметры.ДатаРешения;
	КомментарийРешения = Параметры.КомментарийРешения;
	
	ЗаполнитьКандидатов(Параметры);
	ЗаполнитьДругихКандидатов();

	Если Решение = Перечисления.СостоянияСогласования.Отклонено Тогда
		ПричинаОтклонения = Параметры.ПричинаОтклонения;
		Если Не ЗначениеЗаполнено(ПричинаОтклонения) Тогда
			ПричинаОтклонения = ПодборПерсонала.ПричинаОтклоненияКандидатаПоУмолчанию();
		КонецЕсли;
	КонецЕсли;
	
	// Значения по умолчанию.
	Если Не ЗначениеЗаполнено(ДатаРешения) Тогда
		ДатаРешения = ТекущаяДатаСеанса();
	КонецЕсли;
	
	НастроитьЭлементыФормы(Параметры);
	
	ЗаполнитьШаблонПисьмаПоУмолчанию(ШаблонПисьмаОбОдобрении, Перечисления.ИспользованиеШаблоновСообщенийПриПодбореПерсонала.ОдобрениеКандидата);
	ЗаполнитьШаблонSMSПоУмолчанию(ШаблонSMSОбОдобрении, Перечисления.ИспользованиеШаблоновСообщенийПриПодбореПерсонала.ОдобрениеКандидата);
	ЗаполнитьШаблонПисьмаПоУмолчанию(ШаблонПисьмаОбОтказе, Перечисления.ИспользованиеШаблоновСообщенийПриПодбореПерсонала.ОтклонениеКандидата);
	ЗаполнитьШаблонSMSПоУмолчанию(ШаблонSMSОбОтказе, Перечисления.ИспользованиеШаблоновСообщенийПриПодбореПерсонала.ОтклонениеКандидата);
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ВзаимодействияСписок, "Предмет", Кандидат);
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	Если НаписатьПисьмоКандидатамОбОдобрении И Не ЗначениеЗаполнено(ШаблонПисьмаОбОдобрении) Тогда
		ТекстСообщения = НСтр("ru = 'Не заполнен шаблон письма об одобрении кандидатов.'");
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, , "ШаблонПисьмаОбОдобрении", , Отказ);
	КонецЕсли;
	
	Если ОтправитьSMSКандидатамОбОдобрении И Не ЗначениеЗаполнено(ШаблонSMSОбОдобрении) Тогда
		ТекстСообщения = НСтр("ru = 'Не заполнен шаблон SMS об одобрении кандидатов.'");
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, , "ШаблонSMSОбОдобрении", , Отказ);
	КонецЕсли;
	
	Если НаписатьПисьмоКандидатамОбОтказе И Не ЗначениеЗаполнено(ШаблонПисьмаОбОтказе) Тогда
		ТекстСообщения = НСтр("ru = 'Не заполнен шаблон письма об отказе кандидатам.'");
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, , "ШаблонПисьмаОбОтказе", , Отказ);
	КонецЕсли;
	
	Если ОтправитьSMSКандидатамОбОтказе И Не ЗначениеЗаполнено(ШаблонSMSОбОтказе) Тогда
		ТекстСообщения = НСтр("ru = 'Не заполнен шаблон SMS об отказе кандидатам.'");
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, , "ШаблонSMSОбОтказе", , Отказ);
	КонецЕсли;
	
	ИндексЭлемента = ПроверяемыеРеквизиты.Найти("ГруппаДоступа");
	Если ИндексЭлемента <> Неопределено И Не Элементы.ГруппаДоступаГруппа.Видимость Тогда
		ПроверяемыеРеквизиты.Удалить(ИндексЭлемента);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура НаписатьПисьмоКандидатамОбОтказеПриИзменении(Элемент)
	УстановитьДоступностьШаблонаПисьмаОбОтказе(ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура ОтправитьSMSКандидатамОбОтказеПриИзменении(Элемент)
	УстановитьДоступностьШаблонаSMSОбОтказе(ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура НаписатьПисьмоКандидатамОбОдобренииПриИзменении(Элемент)
	УстановитьДоступностьШаблонаПисьмаОбОдобрении(ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура ОтправитьSMSКандидатамОбОдобренииПриИзменении(Элемент)
	УстановитьДоступностьШаблонаSMSОбОдобрении(ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура ЗакрыватьВакансиюПриИзменении(Элемент)
	УстановитьДоступностьОтклоненияДругихКандидатов(ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура ОтклонитьДругихКандидатовПриИзменении(Элемент)
	УстановитьДоступностьДругихКандидатов(ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура ШаблонПисьмаОбОдобренииНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	НачатьВыборШаблона("Письмо", ВладелецШаблонаПоРешению(Решение), Элемент.Имя);
КонецПроцедуры

&НаКлиенте
Процедура ШаблонSMSОбОдобренииНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	НачатьВыборШаблона("СообщениеSMS", ВладелецШаблонаПоРешению(Решение), Элемент.Имя);
КонецПроцедуры

&НаКлиенте
Процедура ШаблонПисьмаОбОтказеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	НачатьВыборШаблона("Письмо", ВладелецШаблонаПоРешению(Решение), Элемент.Имя);
КонецПроцедуры

&НаКлиенте
Процедура ШаблонSMSОбОтказеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	НачатьВыборШаблона("СообщениеSMS", ВладелецШаблонаПоРешению(Решение), Элемент.Имя);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыВзаимодействияСписок

&НаКлиенте
Процедура ВзаимодействияСписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.ВзаимодействияСписок.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПоказатьЗначение(, ТекущиеДанные.Ссылка);
	СтандартнаяОбработка = Ложь;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОК(Команда)
	
	Если ТолькоПросмотрРешения Тогда
		Закрыть(Неопределено);
		Возврат;
	КонецЕсли;
	
	Если Не ПроверитьЗаполнение() Тогда
		Возврат;
	КонецЕсли;
	
	РезультатВыбора = РезультатВыбора();
	Закрыть(РезультатВыбора);
	
КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)
	
	Закрыть(Неопределено);
	
КонецПроцедуры

&НаКлиенте
Процедура НаписатьПисьмо(Команда)
	
	Если Не ИспользоватьШаблоныСообщений Тогда
		ВзаимодействияКлиент.СоздатьВзаимодействиеИлиПредмет("Документ.ЭлектронноеПисьмоИсходящее.ФормаОбъекта", Кандидат, ЭтаФорма);
		Возврат;
	КонецЕсли;
	
	НачатьФормированиеСообщенияПоШаблону("Письмо");
	
КонецПроцедуры

&НаКлиенте
Процедура ОтправитьSMS(Команда)
	
	Если Не ИспользоватьШаблоныСообщений Тогда
		ВзаимодействияКлиент.СоздатьВзаимодействиеИлиПредмет("Документ.СообщениеSMS.ФормаОбъекта", Кандидат, ЭтаФорма);
		Возврат;
	КонецЕсли;
	
	НачатьФормированиеСообщенияПоШаблону("СообщениеSMS");
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Функция ОтклоненныеКандидаты()
	
	ОтклоненныеКандидаты = Новый Массив;
	Для Каждого СтрокаТаблицы Из ДругиеКандидаты Цикл
		Если Не СтрокаТаблицы.Отклонять Тогда
			Продолжить;
		КонецЕсли;
		Отклонение = Новый Структура("Кандидат, ПричинаОтклонения");
		Отклонение.Кандидат = СтрокаТаблицы.Кандидат;
		Отклонение.ПричинаОтклонения = СтрокаТаблицы.ПричинаОтклонения;
		ОтклоненныеКандидаты.Добавить(Отклонение);
	КонецЦикла;
	
	Возврат ОтклоненныеКандидаты;
	
КонецФункции

&НаСервере
Процедура НастроитьЭлементыФормы(ПараметрыФормы)
	
	ИспользоватьШаблоныСообщений = ПолучитьФункциональнуюОпцию("ИспользоватьШаблоныСообщений");
	
	НастроитьПараметрыВыбораШаблоновСообщений();
	
	УстановитьДоступностьШаблонаПисьмаОбОтказе(ЭтаФорма);
	УстановитьДоступностьШаблонаSMSОбОтказе(ЭтаФорма);
	
	УстановитьДоступностьШаблонаПисьмаОбОдобрении(ЭтаФорма);
	УстановитьДоступностьШаблонаSMSОбОдобрении(ЭтаФорма);
	
	УстановитьВидимостьВзаимодействий();
	УстановитьВидимостьСообщитьОбОдобрении();
	УстановитьВидимостьСообщитьОбОтказе();
	
	Элементы.ПричинаГруппа.Видимость = Ложь;
	Элементы.ВакансияГруппа.Видимость = Ложь;
	Элементы.ДругиеКандидатыГруппа.Видимость = Ложь;
	Элементы.КандидатыГруппа.Видимость = Ложь;
	Элементы.ПредупреждениеГруппа.Видимость = Ложь;
	Элементы.РешениеОПриемеНаРаботуГруппа.Видимость = Ложь;
	
	Если Кандидаты.Количество() > 1 Тогда
		Элементы.КандидатыГруппа.Видимость = Истина;
		ПредставлениеРежимаРаботы = ПредставлениеРежимаРаботы + "CКандидатами";
	КонецЕсли;
	
	НастроитьЭлементыФормыДляСогласования(ПараметрыФормы);
	НастроитьЭлементыФормыДляОтклонения(ПараметрыФормы);
	
	Если ТолькоПросмотрРешения Тогда
		Элементы.ДатаРешения.ТолькоПросмотр = Истина;
		Элементы.ПричинаОтклонения.ТолькоПросмотр = Истина;
		Элементы.КомментарийРешения.ТолькоПросмотр = Истина;
		Элементы.ВзаимодействияСписок.ПоложениеКоманднойПанели = ПоложениеКоманднойПанелиЭлементаФормы.Нет;
	КонецЕсли;
	
	КлючСохраненияПоложенияОкна = ПредставлениеРежимаРаботы;
	
КонецПроцедуры

&НаСервере
Процедура НастроитьЭлементыФормыДляСогласования(ПараметрыФормы)
	
	Если Решение <> Перечисления.СостоянияСогласования.Согласовано Тогда
		Возврат;
	КонецЕсли;
	
	Если Кандидаты.Количество() > 1 Тогда
		Заголовок = НСтр("ru = 'Утверждение кандидатов'");
		Возврат;
	КонецЕсли;
	
	Заголовок = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		НСтр("ru = 'Утверждение %1'"),
		ПодборПерсонала.СклонениеКандидата(Кандидат, 2));
	
	Если ПолучитьФункциональнуюОпцию("ИспользоватьРешениеОПриемеНаРаботу") 
		И Документы.РешениеОПриемеНаРаботу.РешениеПоКандидату(Кандидат) = Неопределено Тогда
		Элементы.РешениеОПриемеНаРаботуГруппа.Видимость = Истина;
		СоздаватьРешениеОПриемеНаРаботу = Истина;
		ПредставлениеРежимаРаботы = ПредставлениеРежимаРаботы + "СФлажкомСозданияРешенияОПриеме";
	КонецЕсли;
	
	Если ТолькоПросмотрРешения Тогда
		Элементы.ГруппаДоступаГруппа.Видимость = Ложь;
	Иначе
		ОграничиватьДоступНаУровнеЗаписей = ПолучитьФункциональнуюОпцию("ОграничиватьДоступНаУровнеЗаписей")
			И ПолучитьФункциональнуюОпцию("ОграничиватьДоступНаУровнеЗаписейФизическиеЛица");
		КоличествоКандидатовБезФизическихЛиц = 0;
		Для Каждого СтрокаТаблицы Из Кандидаты Цикл
			Если Не ЗначениеЗаполнено(СтрокаТаблицы.ФизическоеЛицо) Тогда
				КоличествоКандидатовБезФизическихЛиц = КоличествоКандидатовБезФизическихЛиц + 1;
				Если КоличествоКандидатовБезФизическихЛиц > 1 Тогда
					Прервать;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		Элементы.ГруппаДоступаГруппа.Видимость =
			ОграничиватьДоступНаУровнеЗаписей И КоличествоКандидатовБезФизическихЛиц > 0;
		Если КоличествоКандидатовБезФизическихЛиц > 1 Тогда
			Элементы.ГруппаДоступа.Заголовок = НСтр("ru = 'Физические лица будут включены в группу доступа'");
		КонецЕсли;
	КонецЕсли;
	Если Элементы.ГруппаДоступаГруппа.Видимость Тогда
		ПредставлениеРежимаРаботы = ПредставлениеРежимаРаботы + "CГруппойДоступа";
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Вакансия) Тогда
		Элементы.ПредупреждениеГруппа.Видимость = Истина;
		Элементы.ПредупреждениеНадпись.Заголовок = НСтр("ru = 'Вакансия не заполнена'");
		ПредставлениеРежимаРаботы = ПредставлениеРежимаРаботы + "CПредупреждениемВакансияНеЗаполнена";
		Возврат;
	КонецЕсли;
	
	Если ПолучитьФункциональнуюОпцию("ИспользоватьСогласованиеВакансий") Тогда
		ДанныеСогласования = Справочники.Вакансии.ДанныеСогласования(Вакансия);
		Если ДанныеСогласования.СостояниеСогласования <> Перечисления.СостоянияСогласования.Согласовано Тогда
			Элементы.ПредупреждениеГруппа.Видимость = Истина;
			Элементы.ПредупреждениеНадпись.Заголовок = НСтр("ru = 'Вакансия не согласована'");
			ПредставлениеРежимаРаботы = ПредставлениеРежимаРаботы + "CПредупреждениемВакансияНеСогласована";
			Если ДанныеСогласования.СостояниеСогласования = Перечисления.СостоянияСогласования.Отклонено Тогда
				Элементы.ПредупреждениеНадпись.Заголовок = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
					НСтр("ru = 'Вакансия отклонена. Отклонил %1 %2'"),
					ДанныеСогласования.Рассмотрел,
					ДанныеСогласования.ДатаРассмотрения);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Если Справочники.Вакансии.СпособНабораМассовый(Вакансия) Тогда
		Возврат;
	КонецЕсли;
	
	Элементы.ВакансияГруппа.Видимость = Истина;
	ЗакрыватьВакансию = Истина;
	ПредставлениеРежимаРаботы = ПредставлениеРежимаРаботы + "CВакансией";
	
	Если ДругиеКандидаты.Количество() > 0 Тогда
		ОтклонитьДругихКандидатов = Истина;
		Элементы.ДругиеКандидатыГруппа.Видимость = Истина;
		ПредставлениеРежимаРаботы = ПредставлениеРежимаРаботы + "CДругимиКандидатами";
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура НастроитьЭлементыФормыДляОтклонения(ПараметрыФормы)
	
	Если Решение <> Перечисления.СостоянияСогласования.Отклонено Тогда
		Возврат;
	КонецЕсли;
	
	Элементы.ПричинаГруппа.Видимость = Истина;
	ПредставлениеРежимаРаботы = ПредставлениеРежимаРаботы + "CПричинойОтклонения";

	Если Кандидаты.Количество() > 1 Тогда
		Заголовок = НСтр("ru = 'Отклонение кандидатов'");
		Возврат;
	КонецЕсли;
	
	Заголовок = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		НСтр("ru = 'Отклонение %1'"),
		ПодборПерсонала.СклонениеКандидата(Кандидат, 2));
	
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьВзаимодействий()
	
	Если Не ПравоДоступа("Чтение", Метаданные.ЖурналыДокументов.Взаимодействия) Тогда
		Элементы.ВзаимодействияГруппа.Видимость = Ложь;
		Возврат;
	КонецЕсли;
	
	Если Не ПолучитьФункциональнуюОпцию("ИспользоватьПрочиеВзаимодействия") Тогда
		Элементы.ВзаимодействияГруппа.Видимость = Ложь;
		Возврат;
	КонецЕсли;

	ПредставлениеРежимаРаботы = ПредставлениеРежимаРаботы + "CВзаимодействиями";
	
	Если Кандидаты.Количество() = 1 Тогда
		Элементы.ВзаимодействияГруппа.Видимость = Истина;
		Возврат;
	КонецЕсли;
	
	Элементы.ВзаимодействияГруппа.Видимость = Истина;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьСообщитьОбОдобрении()
	
	Если Не ПолучитьФункциональнуюОпцию("ИспользоватьШаблоныСообщений") Тогда
		Элементы.СообщитьОбОдобренииГруппа.Видимость = Ложь;
		Возврат;
	КонецЕсли;
	
	Если Решение = Перечисления.СостоянияСогласования.Согласовано И Кандидаты.Количество() > 1 Тогда
		Элементы.СообщитьОбОдобренииГруппа.Видимость = Истина;
		ПредставлениеРежимаРаботы = ПредставлениеРежимаРаботы + "CСообщениемОбОдобрении";
		Возврат;
	КонецЕсли;
	
	Элементы.СообщитьОбОдобренииГруппа.Видимость = Ложь;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьСообщитьОбОтказе()
	
	Если Не ПолучитьФункциональнуюОпцию("ИспользоватьШаблоныСообщений") Тогда
		Элементы.СообщитьОбОтказеГруппа.Видимость = Ложь;
		Возврат;
	КонецЕсли;
	
	Если Решение = Перечисления.СостоянияСогласования.Отклонено И Кандидаты.Количество() > 1 Тогда
		Элементы.СообщитьОбОтказеГруппа.Видимость = Истина;
		ПредставлениеРежимаРаботы = ПредставлениеРежимаРаботы + "CСообщениемОбОтказе";
		Возврат;
	КонецЕсли;
	
	Если Решение = Перечисления.СостоянияСогласования.Согласовано И Кандидаты.Количество() = 1 И ДругиеКандидаты.Количество() > 1 Тогда
		Элементы.СообщитьОбОтказеГруппа.Видимость = Истина;
		ПредставлениеРежимаРаботы = ПредставлениеРежимаРаботы + "CСообщениемОбОтказе";
		Возврат;
	КонецЕсли;
	
	Элементы.СообщитьОбОтказеГруппа.Видимость = Ложь;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьКандидатов(ПараметрыФормы)
	
	// Заполним список кандидатов с вакансиями.
	ВакансииКандидатов = ОбщегоНазначения.ЗначениеРеквизитаОбъектов(ПараметрыФормы.Кандидаты, "Вакансия");
	
	УстановитьПривилегированныйРежим(Истина);
	ДанныеКандидатов = Справочники.Кандидаты.ДанныеКандидатов(ПараметрыФормы.Кандидаты);
	УстановитьПривилегированныйРежим(Ложь);
	ОбщегоНазначенияБЗК.ДобавитьИндексКоллекции(ДанныеКандидатов, "Кандидат");
	
	Для Каждого ЭлементМассива Из ПараметрыФормы.Кандидаты Цикл
		НоваяСтрока = Кандидаты.Добавить();
		НоваяСтрока.Кандидат = ЭлементМассива;
		НоваяСтрока.Вакансия = ВакансииКандидатов[НоваяСтрока.Кандидат];
		НайденнаяСтрока = ДанныеКандидатов.Найти(ЭлементМассива, "Кандидат");
		НоваяСтрока.ФизическоеЛицо = НайденнаяСтрока.ФизическоеЛицо;
	КонецЦикла;
	
	Если Кандидаты.Количество() = 1 Тогда
		Кандидат = Кандидаты[0].Кандидат;
		Вакансия = Кандидаты[0].Вакансия;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДругихКандидатов()
	
	Запрос = Новый Запрос();
	Запрос.УстановитьПараметр("Вакансия", Вакансия);
	Запрос.УстановитьПараметр("Кандидат", Кандидат);
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Кандидаты.Ссылка КАК Кандидат,
		|	ТекущийЭтап.ЭтапРаботы КАК ЭтапРаботы,
		|	Кандидаты.Рейтинг КАК Рейтинг,
		|	Кандидаты.ПричинаОтклонения КАК ПричинаОтклонения
		|ИЗ
		|	Справочник.Кандидаты КАК Кандидаты
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ТекущиеЭтапыРаботыСКандидатами КАК ТекущийЭтап
		|		ПО (ТекущийЭтап.Кандидат = Кандидаты.Ссылка)
		|ГДЕ
		|	Кандидаты.Вакансия = &Вакансия
		|	И Кандидаты.Ссылка <> &Кандидат
		|	И Кандидаты.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияСогласования.Рассматривается)";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		НоваяСтрока = ДругиеКандидаты.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
		НоваяСтрока.Отклонять = Истина;
		Если Не ЗначениеЗаполнено(НоваяСтрока.ПричинаОтклонения) Тогда
			НоваяСтрока.ПричинаОтклонения = ПодборПерсонала.ПричинаОтклоненияКандидатаПоУмолчанию();
		КонецЕсли;
	КонецЦикла;
		
КонецПроцедуры

&НаКлиенте
Функция РезультатВыбора()
	
	Результат = ПодборПерсоналаКлиентСервер.ОписаниеРешенияПоКандидатам(); 
	
	КандидатыМассив = Новый Массив;
	Для Каждого СтрокаТаблицы Из Кандидаты Цикл
		КандидатыМассив.Добавить(СтрокаТаблицы.Кандидат);
	КонецЦикла;
	
	Результат.Кандидаты = Новый ФиксированныйМассив(КандидатыМассив);
	Результат.Вакансии = Новый Массив;
	
	Результат.Решение.Решение = Решение;
	Результат.Решение.ДатаРешения = ДатаРешения;
	Результат.Решение.Причина = ПричинаОтклонения;
	Результат.Решение.Комментарий = КомментарийРешения;
	
	Результат.Вакансия.ЗакрыватьВакансию = ЗакрыватьВакансию;
	Результат.Вакансия.Вакансия = Вакансия;
	Результат.Вакансия.Дата = ДатаРешения;
	
	Результат.ДругиеКандидаты.Отклонять = ОтклонитьДругихКандидатов;
	Результат.ДругиеКандидаты.Кандидаты = ОтклоненныеКандидаты();
	Результат.ДругиеКандидаты.Дата = ДатаРешения;
	
	ДругиеКандидатыМассив = Новый Массив;
	Для Каждого Элемент Из Результат.ДругиеКандидаты.Кандидаты Цикл
		ДругиеКандидатыМассив.Добавить(Элемент.Кандидат);
	КонецЦикла;
	
	Результат.ПисьмоОдобрение.Написать = НаписатьПисьмоКандидатамОбОдобрении;
	Если НаписатьПисьмоКандидатамОбОдобрении Тогда
		Результат.ПисьмоОдобрение.Шаблон = ШаблонПисьмаОбОдобрении;
		Результат.ПисьмоОдобрение.Получатели = Новый ФиксированныйМассив(КандидатыМассив);
	КонецЕсли;
	
	Результат.СообщениеSMSОдобрение.Написать = ОтправитьSMSКандидатамОбОдобрении;
	Если ОтправитьSMSКандидатамОбОдобрении Тогда
		Результат.СообщениеSMSОдобрение.Шаблон = ШаблонSMSОбОдобрении;
		Результат.СообщениеSMSОдобрение.Получатели = Новый ФиксированныйМассив(КандидатыМассив);
	КонецЕсли;
	
	Результат.ПисьмоОтказ.Написать = НаписатьПисьмоКандидатамОбОтказе;
	Если НаписатьПисьмоКандидатамОбОтказе Тогда
		Результат.ПисьмоОтказ.Шаблон = ШаблонПисьмаОбОтказе;
		Если Решение = ПредопределенноеЗначение("Перечисление.СостоянияСогласования.Отклонено") Тогда 
			Результат.ПисьмоОтказ.Получатели = Новый ФиксированныйМассив(КандидатыМассив);
		ИначеЕсли Решение = ПредопределенноеЗначение("Перечисление.СостоянияСогласования.Согласовано") Тогда 
			// Другие кандидаты
			Результат.ПисьмоОтказ.Получатели = Новый ФиксированныйМассив(ДругиеКандидатыМассив);
		КонецЕсли;
	КонецЕсли;
	
	Результат.СообщениеSMSОтказ.Написать = ОтправитьSMSКандидатамОбОтказе;
	Если ОтправитьSMSКандидатамОбОтказе Тогда
		Результат.СообщениеSMSОтказ.Шаблон = ШаблонSMSОбОтказе;
		Если Решение = ПредопределенноеЗначение("Перечисление.СостоянияСогласования.Отклонено") Тогда 
			Результат.СообщениеSMSОтказ.Получатели = Новый ФиксированныйМассив(КандидатыМассив);
		ИначеЕсли Решение = ПредопределенноеЗначение("Перечисление.СостоянияСогласования.Согласовано") Тогда 
			// Другие кандидаты
			Результат.СообщениеSMSОтказ.Получатели = Новый ФиксированныйМассив(ДругиеКандидатыМассив);
		КонецЕсли;
	КонецЕсли;
	
	Если СоздаватьРешениеОПриемеНаРаботу Тогда
		Результат.РешениеОПриемеНаРаботу.Создавать = Истина;
	КонецЕсли;

	Результат.ГруппаДоступа = ГруппаДоступа;
	
	Возврат Результат;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьДоступностьОтклоненияДругихКандидатов(Форма)
	
	Элементы = Форма.Элементы;
	
	Элементы.ОтклонитьДругихКандидатов.Доступность = Форма.ЗакрыватьВакансию;
	Если Не Форма.ЗакрыватьВакансию Тогда
		Форма.ОтклонитьДругихКандидатов = Ложь;
		УстановитьДоступностьДругихКандидатов(Форма);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьДоступностьДругихКандидатов(Форма)
	
	Элементы = Форма.Элементы;
	
	Элементы.ДругиеКандидаты.ТолькоПросмотр = Не Форма.ОтклонитьДругихКандидатов;
	
	Элементы.НаписатьПисьмоКандидатамОбОтказе.Доступность = Форма.ОтклонитьДругихКандидатов;
	Элементы.ОтправитьSMSКандидатамОбОтказе.Доступность = Форма.ОтклонитьДругихКандидатов;
	
	Если Не Форма.ОтклонитьДругихКандидатов Тогда
		Форма.НаписатьПисьмоКандидатамОбОтказе = Ложь;
		Форма.ОтправитьSMSКандидатамОбОтказе = Ложь;
		УстановитьДоступностьШаблонаПисьмаОбОтказе(Форма);
		УстановитьДоступностьШаблонаSMSОбОтказе(Форма);
	КонецЕсли;
	
КонецПроцедуры

#Область ШаблоныСообщений

&НаКлиенте
Процедура НачатьФормированиеСообщенияПоШаблону(ВидСообщения)
	
	ШаблоныСообщенийКлиент.СформироватьСообщение(Кандидат, ВидСообщения, Неопределено, ВладелецШаблонаПоРешению(Решение)); 
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ВладелецШаблонаПоРешению(Решение)
	
	Если Решение = ПредопределенноеЗначение("Перечисление.СостоянияСогласования.Согласовано") Тогда
		Возврат ПредопределенноеЗначение("Перечисление.ИспользованиеШаблоновСообщенийПриПодбореПерсонала.ОдобрениеКандидата");
	ИначеЕсли Решение = ПредопределенноеЗначение("Перечисление.СостоянияСогласования.Отклонено") Тогда
		Возврат ПредопределенноеЗначение("Перечисление.ИспользованиеШаблоновСообщенийПриПодбореПерсонала.ОтклонениеКандидата");
	Иначе
		Возврат Неопределено; 
	КонецЕсли;
	
КонецФункции

&НаСервере
Процедура ЗаполнитьШаблонПоУмолчанию(Шаблон, Отбор)
	
	Шаблоны = ПодборПерсонала.ШаблоныСообщенийКандидатов(Отбор);
	Если Шаблоны.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Шаблон = Шаблоны[0].Ссылка;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьШаблонПисьмаПоУмолчанию(Шаблон, ВладелецШаблона)
	
	Отбор = Новый Структура("ВладелецШаблона, ПредназначенДляЭлектронныхПисем");
	Отбор.ВладелецШаблона = ВладелецШаблона;
	Отбор.ПредназначенДляЭлектронныхПисем = Истина;
	
	ЗаполнитьШаблонПоУмолчанию(Шаблон, Отбор);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьШаблонSMSПоУмолчанию(Шаблон, ВладелецШаблона)
	
	Отбор = Новый Структура("ВладелецШаблона, ПредназначенДляSMS");
	Отбор.ВладелецШаблона = ВладелецШаблона;
	Отбор.ПредназначенДляSMS = Истина;
	
	ЗаполнитьШаблонПоУмолчанию(Шаблон, Отбор);
	
КонецПроцедуры

&НаСервере
Процедура НастроитьПараметрыВыбораШаблоновСообщений()
	
	ПредметКандидаты = Новый ПараметрВыбора("Отбор.ПолноеИмяТипаПараметраВводаНаОсновании", Метаданные.Справочники.Кандидаты.ПолноеИмя());
	ВладелецОдобрение = Новый ПараметрВыбора("Отбор.ВладелецШаблона", Перечисления.ИспользованиеШаблоновСообщенийПриПодбореПерсонала.ОдобрениеКандидата);
	ВладелецОтклонение = Новый ПараметрВыбора("Отбор.ВладелецШаблона", Перечисления.ИспользованиеШаблоновСообщенийПриПодбореПерсонала.ОтклонениеКандидата);
	ТипПисьмо = Новый ПараметрВыбора("Отбор.ПредназначенДляЭлектронныхПисем", Истина);
	ТипSMS= Новый ПараметрВыбора("Отбор.ПредназначенДляSMS", Истина);

	ПараметрыВыбора = Новый Массив;
	ПараметрыВыбора.Добавить(ПредметКандидаты);
	ПараметрыВыбора.Добавить(ВладелецОдобрение);
	ПараметрыВыбора.Добавить(ТипПисьмо);
	Элементы.ШаблонПисьмаОбОдобрении.ПараметрыВыбора = Новый ФиксированныйМассив(ПараметрыВыбора);

	ПараметрыВыбора = Новый Массив;
	ПараметрыВыбора.Добавить(ПредметКандидаты);
	ПараметрыВыбора.Добавить(ВладелецОтклонение);
	ПараметрыВыбора.Добавить(ТипПисьмо);
	Элементы.ШаблонПисьмаОбОтказе.ПараметрыВыбора = Новый ФиксированныйМассив(ПараметрыВыбора);

	ПараметрыВыбора = Новый Массив;
	ПараметрыВыбора.Добавить(ПредметКандидаты);
	ПараметрыВыбора.Добавить(ВладелецОдобрение);
	ПараметрыВыбора.Добавить(ТипSMS);
	Элементы.ШаблонSMSОбОдобрении.ПараметрыВыбора = Новый ФиксированныйМассив(ПараметрыВыбора);

	ПараметрыВыбора = Новый Массив;
	ПараметрыВыбора.Добавить(ПредметКандидаты);
	ПараметрыВыбора.Добавить(ВладелецОтклонение);
	ПараметрыВыбора.Добавить(ТипSMS);
	Элементы.ШаблонSMSОбОтказе.ПараметрыВыбора = Новый ФиксированныйМассив(ПараметрыВыбора);
		
КонецПроцедуры

#Область ШаблоныОтказа

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьДоступностьШаблонаПисьмаОбОтказе(Форма)
	
	Элементы = Форма.Элементы;
	
	Элементы.ШаблонПисьмаОбОтказе.Доступность = Форма.НаписатьПисьмоКандидатамОбОтказе;
	Элементы.ШаблонПисьмаОбОтказе.АвтоОтметкаНезаполненного = Форма.НаписатьПисьмоКандидатамОбОтказе;
	Элементы.ШаблонПисьмаОбОтказе.ОтметкаНезаполненного = Не ЗначениеЗаполнено(Форма.ШаблонПисьмаОбОтказе);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьДоступностьШаблонаSMSОбОтказе(Форма)
	
	Элементы = Форма.Элементы;
	
	Элементы.ШаблонSMSОбОтказе.Доступность = Форма.ОтправитьSMSКандидатамОбОтказе;
	Элементы.ШаблонSMSОбОтказе.АвтоОтметкаНезаполненного = Форма.ОтправитьSMSКандидатамОбОтказе;
	Элементы.ШаблонSMSОбОтказе.ОтметкаНезаполненного = Не ЗначениеЗаполнено(Форма.ШаблонSMSОбОтказе);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьДоступностьШаблонаПисьмаОбОдобрении(Форма)
	
	Элементы = Форма.Элементы;
	
	Элементы.ШаблонПисьмаОбОдобрении.Доступность = Форма.НаписатьПисьмоКандидатамОбОдобрении;
	Элементы.ШаблонПисьмаОбОдобрении.АвтоОтметкаНезаполненного = Форма.НаписатьПисьмоКандидатамОбОдобрении;
	Элементы.ШаблонПисьмаОбОдобрении.ОтметкаНезаполненного = Не ЗначениеЗаполнено(Форма.ШаблонПисьмаОбОдобрении);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьДоступностьШаблонаSMSОбОдобрении(Форма)
	
	Элементы = Форма.Элементы;
	
	Элементы.ШаблонSMSОбОдобрении.Доступность = Форма.ОтправитьSMSКандидатамОбОдобрении;
	Элементы.ШаблонSMSОбОдобрении.АвтоОтметкаНезаполненного = Форма.ОтправитьSMSКандидатамОбОдобрении;
	Элементы.ШаблонSMSОбОдобрении.ОтметкаНезаполненного = Не ЗначениеЗаполнено(Форма.ШаблонSMSОбОдобрении);
	
КонецПроцедуры

&НаКлиенте
Процедура НачатьВыборШаблона(ВидСообщения, ВладелецШаблона, ИмяШаблона)
	
	ПараметрыВыбора = Новый Структура("ИмяШаблона");
	ПараметрыВыбора.ИмяШаблона = ИмяШаблона;
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ЗавершитьВыборШаблона", ЭтотОбъект, ПараметрыВыбора);
	
	ШаблоныСообщенийКлиент.ВыбратьШаблон(
		ОписаниеОповещения, 
		ВидСообщения, 
		"Справочник.Кандидаты", 
		ВладелецШаблона);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗавершитьВыборШаблона(Результат, ДополнительныеПараметры) Экспорт

	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;

	ЭтотОбъект[ДополнительныеПараметры.ИмяШаблона] = Результат;

КонецПроцедуры

#КонецОбласти

#КонецОбласти

#КонецОбласти
